snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_Штуки_Актуальные/СтатусыКМ_Факт_Штуки_Актуальные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт_Штуки_Актуальные</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДокУстановкиСтатуса</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.ЛистМаркировки</types>
      <types>DocumentRef.ЛистМаркировкиОстатков</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_А/СтатусыКМ_Факт_А.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт_А</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ИспользованныеКодыАгрегаций/ИспользованныеКодыАгрегаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованныеКодыАгрегаций</name>
  <comment>Использованные коды агрегаций</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СпособыВводаВОборотСУЗ/СпособыВводаВОборотСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВводаВОборотСУЗ</name>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВРФ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыУпаковок/ТипыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУпаковок</name>
  <enumValues>
    <name>МаркированныйТовар</name>
  </enumValues>
  <enumValues>
    <name>МонотоварнаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>МультитоварнаяУпаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	//Поля.Добавить("ЗначениеШтрихкода");
	//СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//Если Не ПустаяСтрока(Данные.ЗначениеШтрихкода) Тогда
	//	Представление = Данные.ЗначениеШтрихкода;
	//Иначе
	//	Представление = НСтр("ru = 'Штрихкод не указан'");
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

Функция ПолучитьПравилоВыгрузки(ДопПараметры = Неопределено) Экспорт	
	ОперИмпорта					= "Справочник.ШтрихкодыУпаковокТоваров";
	ОперИмпорта_Представление   = "КМ";
	
	ИмяТаблицы_Тек	= "Справочник.ШтрихкодыУпаковокТоваров";	
	ИмяТаблицы_Ист	= "Справочник.ШтрихкодыУпаковокТоваров";
	
	ЗапросыИст = ОбменДаннымиЧЗ.СоздатьТаблицуИменЗапросов();	
	
	#Область ВТ_Ссылки
	
	ТекстЗапросаИзменений = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".Изменения
	|ГДЕ
	|	Узел = &УзелПолучатель
	|	И ВЫБОР 
	|		КОГДА Ссылка.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка) 			ТОГДА Истина //По проcьбе Петрова - коробки - вне очереди
	|		КОГДА Ссылка.СпособВводаВОборот <> ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт) 			ТОГДА Истина //Все кроме импорта
	|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата,День),НАЧАЛОПЕРИОДА(&ТекущаяДата,Час),Час) МЕЖДУ 3 И 4 ТОГДА Истина //Можно вообще все в т.ч. и импорт
	|		КОГДА &ТипУзлаПолучателя <> ЗНАЧЕНИЕ(Перечисление.ТипУзлаИБ.Склад) 									ТОГДА Истина //Филиалы, магазины
	|		КОГДА Ссылка.Владелец.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект) ТОГДА Истина //11.09.2025 - ну очень нужно, ну очень срочно, никак не дотерпеть до вечера
	|		КОГДА Ссылка.Владелец.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект) 		ТОГДА Истина
	|		ИНАЧЕ Ложь //Импорт - штуки - только с 3 до 4 часов утра
	|	КОНЕЦ
	|";			
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Ссылка	
	|ПОМЕСТИТЬ ВТ_Ссылки
	|ИЗ	
	|	" + ИмяТаблицы_Ист + "
	|ГДЕ
	|	Ссылка В (&МассивСсылок)
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";	
	
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ВТ_Ссылки", ТекстЗапроса, Ложь);
	
	#КонецОбласти
	
	#Область Шапка
	
	Поля = Новый Массив;
	Поля.Добавить("Шапка.Ссылка,Шапка.Владелец,Шапка.ПометкаУдаления,Шапка.Наименование,Шапка.ЗаказКМ КАК Основание");
	Для Каждого МетаРекв Из Метаданные.Справочники.ШтрихкодыУпаковокТоваров.Реквизиты Цикл
		Поля.Добавить("Шапка." + МетаРекв.Имя);			
	КонецЦикла; 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	" + СтрСоединить(Поля, ",") + "
    |ИЗ	
	|	" + ИмяТаблицы_Ист + " КАК Шапка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = Шапка.Ссылка
	|УПОРЯДОЧИТЬ ПО 
	|	Наименование
	|";	                                      
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "Шапка", ТекстЗапроса, Истина, Ложь);	
	
	#КонецОбласти
	
	#Область ТЧ_ВложенныеТовары		
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТЧ.*
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".ВложенныеТовары КАК ТЧ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = ТЧ.Ссылка
	|";
	
    ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ТЧ_ВложенныеТовары", ТекстЗапроса, Истина, Истина);
	
	#КонецОбласти
	
	#Область ТЧ_ВложенныеШтрихкоды
	
	ТекстЗапроса = "
	|ВЫБРАТЬ	
	|	ТЧ.*
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".ВложенныеШтрихкоды КАК ТЧ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = ТЧ.Ссылка
	|";	                                      
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ТЧ_ВложенныеШтрихкоды", ТекстЗапроса, Истина);	
	
	#КонецОбласти

	Возврат Новый Структура("РазмерПорции,ТекстЗапросаИзменений,ЗапросыИст,ОперИмпорта,ОперИмпорта_Представление", 5000, ТекстЗапросаИзменений, ЗапросыИст, ОперИмпорта, ОперИмпорта_Представление);
КонецФункции //Экспорт

Функция ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт	
	Результат = МаркировкаКС.СтруктураРезультата();
	
	фПерезаписывать = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "фПерезаписывать", Ложь);
	
	Таблицы	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеПакета, "Таблицы");
	
	Шапка 		= Неопределено;
	ДанныеТЧ 	= Новый Соответствие;
	
	Для Каждого КиЗ Из Таблицы Цикл		
		Если СтрНачинаетсяС(КиЗ.Ключ,"ТЧ_") Тогда
			КиЗ.Значение.Индексы.Добавить("Ссылка");
			ДанныеТЧ[Сред(КиЗ.Ключ, 4)] = КиЗ.Значение;
		ИначеЕсли КиЗ.Ключ = "Шапка" Тогда
			Шапка = КиЗ.Значение;			
		КонецЕсли;		
	КонецЦикла;	  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Шапка ИЗ &Шапка КАК Шапка
	|;
	|ВЫБРАТЬ
	|	IsNULL(Ссылка.ВерсияДанных,"""") КАК ВерсияДанных,
	|	*
	|ИЗ
	|	ВТ_Шапка
	|ГДЕ
	|	Ссылка.ВерсияДанных ЕСТЬ NULL
	|	ИЛИ Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	|	ИЛИ Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка)
	|	ИЛИ Ссылка.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|	ИЛИ &фПерезаписывать
	|";  
	
	Запрос.УстановитьПараметр("Шапка", 				Шапка);
	Запрос.УстановитьПараметр("фПерезаписывать",	фПерезаписывать);	
	
	Менеджер = Справочники.ШтрихкодыУпаковокТоваров;
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;
	ОшибокЗаписи = 0;
	
	Начало 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	СовсемНачало= Начало;
	
	ОшибкиЗаписи = ОбменДаннымиЧЗ.СоздатьТаблицуОшибокЗаписи();	
	
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Если ЗначениеЗаполнено(Выборка.ВерсияДанных) Тогда
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
		Иначе			
			СпрОбъект = Менеджер.СоздатьЭлемент();		
			СпрОбъект.УстановитьСсылкуНового(Выборка.Ссылка);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СпрОбъект, Выборка, , "Ссылка");		
		
		Для Каждого КиЗ Из ДанныеТЧ Цикл
			СтрокиТЧ = КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));		
			
			ТЧ_Объекта = СпрОбъект[КиЗ.Ключ];
			
			ТЧ_Объекта.Очистить();			
			Для Каждого СтрокаТЧ_Ист Из КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка)) Цикл
				СтрокаТЧ_Тек = ТЧ_Объекта.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ_Тек, СтрокаТЧ_Ист);			
			КонецЦикла; 
		КонецЦикла;
		
		СпрОбъект.ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи", Истина);
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.ОбменДанными.Отправитель = Отправитель;
		
		Попытка
			СпрОбъект.Записать();		
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		Исключение
			СтрокаО = ОшибкиЗаписи.Добавить();
				
			СтрокаО.Основание	= СпрОбъект.ЗаказКМ;
			СтрокаО.ТекстОшибки	= ОписаниеОшибки();
			СтрокаО.Дата		= ТекущаяДата();
				
			ОшибокЗаписи = ОшибокЗаписи + 1;
		КонецПопытки;		
		
		Сч = Сч + 1;
		Если Сч % 100 = 0 Тогда
			ТекстСообщения = СтрШаблон("Загрузка КМ. Загружено: %1 из %2 элементов.", Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
		КонецЕсли;
		
		Если Сч % 1000 = 0 Тогда
			Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
			ТекстСообщения = СтрШаблон("Записано 1000 КМ. Время выполнения: %1, скорость записи: %2 кодов/с.", Время, Формат(1000 / Время, "ЧДЦ=0"));			
			ЗаписатьВЛог("Загрузка КМ", ТекстСообщения, "Информация", , , Время);
			
			Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		КонецЕсли;		
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Шапка.Количество();Результат.Вставить("ПрочитаноОбъектов", Шапка.Количество()); 
	Результат.Вставить("ОшибокЗаписи", 	ОшибокЗаписи);
	Результат.Вставить("ОшибкиЗаписи", 	ОшибкиЗаписи);
	
	Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - СовсемНачало)/1000;
	ТекстСообщения = СтрШаблон("Окончание загрузки пакета. Прочитано: %1, записано: %2, ошибок записи: %3.",  Результат.ПрочитаноОбъектов, Результат.ОбработаноОбъектов, ОшибокЗаписи);
	ЗаписатьВЛог("Загрузка КМ", ТекстСообщения, "Информация", , , Время);
	
	Возврат Результат;	
КонецФункции // ()
	
#КонецОбласти 

#Область РаботаСКодамиGS1

Функция СформироватьНаименованиеШкGS1(ЗначениеШК) Экспорт
	
	Если ТипЗнч(ЗначениеШК) = Тип("Структура") Тогда
		ПоляШК = ЗначениеШК;
	Иначе		
		ПоляШК = ПолучитьПоляШК_GS1(ЗначениеШК);	
	КонецЕсли;	
	
	//Возврат "(01)"+Поля.ГТИН+"(21)"+СтрЗаменить(Поля.СН,Символ(29),"");
	Возврат "01"  +ПоляШК.ГТИН + "21"  +ПоляШК.СН;	
	
КонецФункции // ()
  
Функция ПолучитьПоляШК_GS1(Знач СтрШК) Экспорт
	СтрШК = СокрЛП(СтрШК);
	
	Если Лев(СтрШК,1) = Символ(232) Тогда  //FNC1 надо отрезать 
		СтрШК = Сред(СтрШК, 2);
	КонецЕсли;
	
	СтрШК = ВосстановитьКод_GS1(СтрШК);
	Части = СтрРазделить(СтрШК, Символ(29));
	
	Если Части.Количество() >= 2 Тогда
		СтрШК 	= Части[0];		
		ИДКП	= Части[1];			
	Иначе
		СтрШК 	= Части[0];		
		ИДКП	= "";
	КонецЕсли; 
	
	ГТИН 	= Сред(СтрШК,	3,	14);
	СН		= Сред(СтрШК,	19,	13);
	//ИДКП	= Сред(СтрШК,	35,	4);	
	
	Возврат Новый Структура("ГТИН,СН,ИДКП", ГТИН, СН, ИДКП);
КонецФункции //ПолучитьПоляШК(Знач СтрШК) Экспорт

Функция ПреобразоватьКод_GS1(Знач СтрШК) Экспорт
	Возврат Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СтрШК));
	//Возврат Лев(СтрШК, 31) + СтрЗаменить(Сред(СтрШК, 32), Символ(29), "<GS>");
КонецФункции // ()
 
Функция ВосстановитьКод_GS1(Знач СтрШК) Экспорт
	Если СтрДлина(СтрШК) > 100 Тогда
		СтрВосстановленная = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(СтрШК));
	Иначе
		СтрВосстановленная = Лев(СтрШК, 31) + СтрЗаменить(Сред(СтрШК, 32), "<GS>", Символ(29)); //<GS> бывает в серийнике	
	КонецЕсли; 
	Возврат СтрВосстановленная;
КонецФункции //ВосстановитьКод_GS1(Знач СтрШК) 

#КонецОбласти 

#Область БронированиеКодов


#Область Штуки

Функция ПолучитьСвободныеКодыШтук(Номенклатура, Количество, ДопПараметры = Неопределено) Экспорт
	ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("Функция.ШтрихКодыУпаковокТоваров.ПолучитьСвободныеКодыШтук");	
	
	Результат = МаркировкаКС.СтруктураРезультата();
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ " + МаркировкаКС.ЧислоБезДури(Количество) + "
	|	ШтрихКодУпаковки
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(,
	|		Номенклатура	= &Номенклатура	
	|		И ТипШК			= ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)	
	|		//Фильтр_МассивДоступныхКодов
	|	)
	|ГДЕ
	|	Местонахождение = &Местонахождение	
	|	И НЕ ВПути	
	|	И Статус = &Статус
	|	И ШтрихКодУпаковки.ТипУпаковки	= ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	|	И ШтрихКодУпаковки.ТипКода		= &ТипКода
	//Валетов + 01,08,2025 Пока отменили
	//|	И (
	//|		ШтрихКодУпаковки.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт)
	//|		ИЛИ ШтрихКодУпаковки.ДатаУпаковки >= ДАТАВРЕМЯ(2025,6,1)
	//|	)	
	|	И НЕ ШтрихКодУпаковки.ПометкаУдаления
	|";	
	
	
	Местонахождение		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Местонахождение",		ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());	
	Статус				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус",				Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати);
	ТипКода				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ТипКода",				ТипКМпоУмолчанию(Номенклатура));
	
	МассивДоступныхКодов = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "МассивДоступныхКодов",	Новый Массив);
	Если МассивДоступныхКодов.Количество() > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Фильтр_МассивДоступныхКодов", "И ШтрихКодУпаковки В (&МассивДоступныхКодов)");	
		Запрос.УстановитьПараметр("МассивДоступныхКодов",МассивДоступныхКодов);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура",		Номенклатура);
	Запрос.УстановитьПараметр("Местонахождение", 	Местонахождение);	
	Запрос.УстановитьПараметр("ТипКода",			ТипКода);
	Запрос.УстановитьПараметр("Статус",				Статус);	
	
	Попытка
		Результат.Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихКодУпаковки");
	Исключение		
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить("Блокировка транзакции: " + ОписаниеОшибки());
		Возврат Результат;		
	КонецПопытки;	
		
	ПолученоКМ = Результат.Данные.Количество();
	Если ПолученоКМ <> Количество Тогда	
		ТекстОшибки = СтрШаблон("Найдено %1 свободных, из %2 требуемых кодов маркировки (штука). Номенклатура: %3 (%4)", ПолученоКМ, Количество, Номенклатура, ПолучитьРеквизитШапки(Номенклатура, "Код"));
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера, Количество);
	
	Возврат Результат;
КонецФункции //ПолучитьСвободныеКодыШтук(Номенклатура, Количество, ДопПараметры = Неопределено) Экспорт

Функция ПолучитьЗабронироватьСвободныеКодыШтук(мНоменклатура, ДокБронирования, Знач ДопПараметры = Неопределено) Экспорт
	сНоменклатуры = Новый Соответствие;
	
	Если ТипЗнч(мНоменклатура) = Тип("Массив") Тогда
		Для Каждого Номенклатура Из мНоменклатура Цикл
			ТекКол = сНоменклатуры[Номенклатура];
			Если ТекКол = Неопределено Тогда
				ТекКол = 0;					
			КонецЕсли; 	
			сНоменклатуры[Номенклатура] = ТекКол + 1; 
		КонецЦикла;		
	ИначеЕсли ТипЗнч(мНоменклатура) = Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаТЧ Из мНоменклатура Цикл
			ТекКол = сНоменклатуры[СтрокаТЧ.Номенклатура];
			Если ТекКол = Неопределено Тогда
				ТекКол = 0;						
			КонецЕсли;
			
			сНоменклатуры[СтрокаТЧ.Номенклатура] = ТекКол + СтрокаТЧ.Количество;
		КонецЦикла; 
	Иначе
		ТекКол = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Количество", 1);
		сНоменклатуры[мНоменклатура] = ТекКол;
	КонецЕсли;	
	
	Результат = МаркировкаКС.СтруктураРезультата();
	Результат.Данные = Новый Соответствие;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;	
	
	Если НЕ ДопПараметры.Свойство("Местонахождение") Тогда
		ДопПараметры.Вставить("Местонахождение", ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());	
	КонецЕсли;
	
	НовыйСтатус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "НовыйСтатус", Перечисления.СтатусыКодовМаркировкиФакт.Распечатан);
	
	ЕстьОшибки = Ложь;
	Для Каждого КиЗ Из сНоменклатуры Цикл
		Номенклатура = Киз.Ключ;
		
		НачатьТранзакцию();
		
		Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Попытка
			//+++Чирков 13.02.2026 - блокировка подставной таблицы - чтобы не мешать записи в основную
			//РегистрыСведений.СтатусыКМ_Факт.ЗаблокироватьТаблицу(Номенклатура);
			РегистрыСведений.СтатусыКМ_Факт_Штуки_Актуальные.ЗаблокироватьТаблицу(Номенклатура);
			//---Чирков 13.02.2026 - блокировка подставной таблицы - чтобы не мешать записи в основную
		Исключение
			ОтменитьТранзакцию();
			
			Результат.Успешно = Ложь;
			
			ТекстОшибки = СтрШаблон("Ном.: '%1'. %2.", Номенклатура, ОписаниеОшибки());
			
			Результат.Ошибки.Добавить("Блокировка транзакции. " + ТекстОшибки);
			
			ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", "Ошибка блокировки таблицы. " + ТекстОшибки, "Ошибка", , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);
			
			Возврат Результат;			
		КонецПопытки;				
		
		Успешно = Ложь;
		
		рПолучения = ПолучитьСвободныеКодыШтук(Номенклатура, КиЗ.Значение, ДопПараметры);		
		Если рПолучения.Успешно Тогда
			Если РегистрыСведений.СтатусыКМ_Факт.УстановитьСтатусКМ(рПолучения.Данные, НовыйСтатус, ДокБронирования, ДопПараметры) Тогда
				Результат.Данные[Номенклатура] = рПолучения.Данные;
				Успешно = Истина;				
			Иначе
				Результат.Ошибки.Добавить("Ошибка обновления статуса кодов штук !");
			КонецЕсли;					
		Иначе			
			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
		КонецЕсли;
		
		Если Успешно Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли; 
	КонецЦикла;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПолучитьЗабронироватьСвободныеКодыШтук(МассивНоменклатуры, ДокБронирования, Знач ДопПараметры = Неопределено) Экспорт

#КонецОбласти


#Область Коробки


Функция ПолучитьЗабронироватьСвободныйКод_Блочок(ТипУпаковки, ДокБронирования, Знач ДопПараметры = Неопределено) Экспорт	
	
	Возврат ПолучитьЗабронироватьСвободныйКодАгрегации(Перечисления.ТипыШтрихКодов.Блочок, ТипУпаковки, ДокБронирования, ДопПараметры);

КонецФункции //ПолучитьЗабронироватьСвободныйКод_Блочок(Местонахождение, ТипУпаковки)

Функция ПолучитьЗабронироватьСвободныйКод_Коробка(ТипУпаковки, ДокБронирования, Знач ДопПараметры = Неопределено) Экспорт	
	
	Возврат ПолучитьЗабронироватьСвободныйКодАгрегации(Перечисления.ТипыШтрихКодов.Коробка, ТипУпаковки, ДокБронирования, ДопПараметры);
	
КонецФункции //ПолучитьСвободныйКодКоробки(Местонахождение, ТипУпаковки)

Функция ПолучитьЗабронироватьСвободныйКод_Палета(ТипУпаковки, ДокБронирования, Знач ДопПараметры = Неопределено) Экспорт
	
	Возврат ПолучитьЗабронироватьСвободныйКодАгрегации(Перечисления.ТипыШтрихКодов.Палета, ТипУпаковки, ДокБронирования, ДопПараметры);
	
КонецФункции //ПолучитьСвободныйКодПалеты(Местонахождение, ТипУпаковки) Экспорт


Функция ПолучитьЗабронироватьСвободныйКодАгрегации(ТипШК, ТипУпаковки, ДокБронирования, Знач ДопПараметры = Неопределено) Экспорт
	Если Маркировка_ПИ.ИспользоватьРегистрСтатусовКоробокДляБронирования() Тогда
		Возврат ПолучитьЗабронироватьСвободныйКодАгрегации_Новая(ТипШК, ТипУпаковки, ДокБронирования, ДопПараметры);
	Иначе
		Возврат ПолучитьЗабронироватьСвободныйКодАгрегации_Старая(ТипШК, ТипУпаковки, ДокБронирования, ДопПараметры);
	КонецЕсли;	
КонецФункции
	
Функция ПолучитьЗабронироватьСвободныйКодАгрегации_Старая(ТипШК, ТипУпаковки, ДокБронирования, Знач ДопПараметры = Неопределено)
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;	
	
	Если НЕ ДопПараметры.Свойство("Местонахождение") Тогда
		ДопПараметры.Вставить("Местонахождение", ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());	
	КонецЕсли;
	
	НовыйСтатус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыКодовМаркировкиФакт.Распечатан);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Попытка
		РегистрыСведений.СтатусыКМ_Факт.ЗаблокироватьТаблицу(Справочники.Номенклатура.ПустаяСсылка(), ТипШК);
	Исключение   
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОписаниеОшибки();
		
		рПолучения = МаркировкаКС.СтруктураРезультата(Ложь);
		рПолучения.Ошибки.Добавить("Блокировка транзакции. " + ТекстОшибки);
		
		ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", "Ошибка блокировки таблицы. " + ТекстОшибки, "Ошибка", , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);
		
		Возврат рПолучения;			
	КонецПопытки;		
	
	рПолучения = ПолучитьСвободныеКодыАгрегации(ТипШК, ТипУпаковки, 1, ДопПараметры);
	Если рПолучения.Успешно Тогда
		Если РегистрыСведений.СтатусыКМ_Факт.УстановитьСтатусКМ(рПолучения.Данные, НовыйСтатус, ДокБронирования, ДопПараметры) Тогда
			ЗафиксироватьТранзакцию();
			
			РегистрыСведений.СтатусыКМ_Факт_А.УстановитьСтатусКМ(рПолучения.Данные, НовыйСтатус, ДокБронирования, ДопПараметры);
			
			рПолучения.Данные = рПолучения.Данные[0];
		Иначе		
			рПолучения.Успешно = Ложь;
			рПолучения.Ошибки.Добавить("Ошибка обновления статуса кодов агрегации !");
			
			ОтменитьТранзакцию();
		КонецЕсли;		
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли; 
	
	Возврат рПолучения;
КонецФункции //ПолучитьЗабронироватьСвободныйКодАгрегации(ТипШК, Местонахождение, ДокБронирования, ДопПараметры = Неопределено) Экспорт

Функция ПолучитьЗабронироватьСвободныйКодАгрегации_Новая(ТипШК, ТипУпаковки, ДокБронирования, Знач ДопПараметры = Неопределено)
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;	
	
	Если НЕ ДопПараметры.Свойство("Местонахождение") Тогда
		ДопПараметры.Вставить("Местонахождение", ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());	
	КонецЕсли;
	
	НовыйСтатус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыКодовМаркировкиФакт.Распечатан);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Попытка
		РегистрыСведений.СтатусыКМ_Факт_А.ЗаблокироватьТаблицуДляПолученияКМ(ТипШК);
	Исключение   
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОписаниеОшибки();
		
		рПолучения = МаркировкаКС.СтруктураРезультата(Ложь);
		рПолучения.Ошибки.Добавить("Блокировка транзакции. " + ТекстОшибки);
		
		ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт_А", "Ошибка блокировки таблицы. " + ТекстОшибки, "Ошибка", , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);
		
		Возврат рПолучения;			
	КонецПопытки;		
	
	рПолучения = ПолучитьСвободныеКодыАгрегации(ТипШК, ТипУпаковки, 1, ДопПараметры);
	Если рПолучения.Успешно Тогда
		Если РегистрыСведений.СтатусыКМ_Факт_А.УстановитьСтатусКМ(рПолучения.Данные, НовыйСтатус, ДокБронирования, ДопПараметры) Тогда
			ЗафиксироватьТранзакцию();
			
			рПолучения.Данные = рПолучения.Данные[0];
		Иначе		
			рПолучения.Успешно = Ложь;
			рПолучения.Ошибки.Добавить("Ошибка обновления статуса кодов агрегации !");
			
			ОтменитьТранзакцию();
		КонецЕсли;		
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли; 
	
	Возврат рПолучения;
КонецФункции //ПолучитьЗабронироватьСвободныйКодАгрегации_Новая(ТипШК, Местонахождение, ДокБронирования, ДопПараметры = Неопределено) Экспорт


Функция ПолучитьЗабронироватьСвободныеКодыАгрегации(ТипШК, ТипУпаковки, Количество, ДокБронирования, ДопПараметры = Неопределено) Экспорт
	Если Маркировка_ПИ.ИспользоватьРегистрСтатусовКоробокДляБронирования() Тогда
		Возврат ПолучитьЗабронироватьСвободныеКодыАгрегации_Новая(ТипШК, ТипУпаковки, Количество, ДокБронирования, ДопПараметры);
	Иначе
		Возврат ПолучитьЗабронироватьСвободныеКодыАгрегации_Старая(ТипШК, ТипУпаковки, Количество, ДокБронирования, ДопПараметры);
	КонецЕсли;
КонецФункции

Функция ПолучитьЗабронироватьСвободныеКодыАгрегации_Старая(ТипШК, ТипУпаковки, Количество, ДокБронирования, ДопПараметры = Неопределено)
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;	
	
	Если НЕ ДопПараметры.Свойство("Местонахождение") Тогда
		ДопПараметры.Вставить("Местонахождение", ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());	
	КонецЕсли;
	
	НовыйСтатус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыКодовМаркировкиФакт.Распечатан);
	
	НачатьТранзакцию();
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Попытка
		РегистрыСведений.СтатусыКМ_Факт.ЗаблокироватьТаблицу(Справочники.Номенклатура.ПустаяСсылка(), ТипШК);
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОписаниеОшибки();
		рПолучения = МаркировкаКС.СтруктураРезультата(Ложь);
		рПолучения.Ошибки.Добавить("Блокировка транзакции. " + ТекстОшибки);
		
		ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", "Ошибка блокировки таблицы. " + ТекстОшибки, "Ошибка", , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);
		
		Возврат рПолучения;
	КонецПопытки;		
	
	рПолучения = ПолучитьСвободныеКодыАгрегации(ТипШК, ТипУпаковки, Количество, ДопПараметры);
	Если рПолучения.Успешно Тогда
		Если РегистрыСведений.СтатусыКМ_Факт.УстановитьСтатусКМ(рПолучения.Данные, НовыйСтатус, ДокБронирования, ДопПараметры) Тогда
			ЗафиксироватьТранзакцию();
			
			//+++Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
			РегистрыСведений.СтатусыКМ_Факт_А.УстановитьСтатусКМ(рПолучения.Данные, НовыйСтатус, ДокБронирования, ДопПараметры);
			//---Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
			
			Результат.Успешно	= Истина;
			Результат.Данные	= рПолучения.Данные;
		Иначе
			Результат.Ошибки.Добавить("Ошибка обновления статуса кодов агрегации ! ");
			
			ОтменитьТранзакцию();		
		КонецЕсли;		
	Иначе		
		ОтменитьТранзакцию();
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции //ПолучитьСвободныеКодыАгрегации(ТипШК, Количество, ДопПараметры = Неопределено) Экспорт

Функция ПолучитьЗабронироватьСвободныеКодыАгрегации_Новая(ТипШК, ТипУпаковки, Количество, ДокБронирования, ДопПараметры = Неопределено)
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;	
	
	Если НЕ ДопПараметры.Свойство("Местонахождение") Тогда
		ДопПараметры.Вставить("Местонахождение", ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());	
	КонецЕсли;
	
	НовыйСтатус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыКодовМаркировкиФакт.Распечатан);
	
	НачатьТранзакцию();
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Попытка
		РегистрыСведений.СтатусыКМ_Факт_А.ЗаблокироватьТаблицуДляПолученияКМ(ТипШК);
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОписаниеОшибки();
		рПолучения = МаркировкаКС.СтруктураРезультата(Ложь);
		рПолучения.Ошибки.Добавить("Блокировка транзакции. " + ТекстОшибки);
		
		ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт_А", "Ошибка блокировки таблицы. " + ТекстОшибки, "Ошибка", , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);
		
		Возврат рПолучения;
	КонецПопытки;		
	
	рПолучения = ПолучитьСвободныеКодыАгрегации_Новая(ТипШК, ТипУпаковки, Количество, ДопПараметры);
	Если рПолучения.Успешно Тогда
		Если РегистрыСведений.СтатусыКМ_Факт_А.УстановитьСтатусКМ(рПолучения.Данные, НовыйСтатус, ДокБронирования, ДопПараметры) Тогда
			ЗафиксироватьТранзакцию();			
			
			Результат.Успешно	= Истина;
			Результат.Данные	= рПолучения.Данные;
		Иначе
			Результат.Ошибки.Добавить("Ошибка обновления статуса кодов агрегации ! ");
			
			ОтменитьТранзакцию();		
		КонецЕсли;		
	Иначе		
		ОтменитьТранзакцию();
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции //ПолучитьЗабронироватьСвободныеКодыАгрегации_Новая(ТипШК, Количество, ДопПараметры = Неопределено) Экспорт


Функция ПолучитьСвободныеКодыАгрегации(ТипШК, ТипУпаковки, Количество, ДопПараметры = Неопределено) Экспорт
	Если Маркировка_ПИ.ИспользоватьРегистрСтатусовКоробокДляБронирования() Тогда
		Возврат ПолучитьСвободныеКодыАгрегации_Новая(ТипШК, ТипУпаковки, Количество, ДопПараметры);
	Иначе                                                                                          
		Возврат ПолучитьСвободныеКодыАгрегации_Старая(ТипШК, ТипУпаковки, Количество, ДопПараметры);
	КонецЕсли;	
КонецФункции

Функция ПолучитьСвободныеКодыАгрегации_Старая(ТипШК, ТипУпаковки, Количество, ДопПараметры = Неопределено)
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат = МаркировкаКС.СтруктураРезультата();
		
	Запрос = Новый Запрос;   
	//Валетов + 09,10,2025 Пустая задача. Добавил проверку кодов по регистру Использованные КА
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ " + МаркировкаКС.ЧислоБезДури(Количество) + "
	|	Статусы.ШтрихКодУпаковки 				КАК ШтрихкодКоробки,
	|	Статусы.ШтрихКодУпаковки.Наименование	КАК КодАгрегации
	|ПОМЕСТИТЬ ВТ_КА
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних( ,
	|		Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		И ТипШК = &ТипШК
	|		И ШтрихКодУпаковки.СпособВводаВОборот В (&СпособВводаВОборот)
	|		И ШтрихКодУпаковки.ТипУпаковки = &ТипУпаковки
	|		И ШтрихКодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|		И ШтрихКодУпаковки.Владелец = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		И НЕ ШтрихКодУпаковки.ПометкаУдаления
	|	) КАК Статусы
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ИспользованныеКодыАгрегаций КАК ИспользованныеКА
	|ПО 
	|	Статусы.ШтрихКодУпаковки = ИспользованныеКА.ШтрихКодУпаковки
	|ГДЕ
	|	Статусы.Местонахождение = &Местонахождение
	|	И НЕ Статусы.ВПути
	|	И Статусы.Статус = &Статус
	|	И ИспользованныеКА.ШтрихКодУпаковки ЕСТЬ NULL
	|;
	|ВЫБРАТЬ
	|	ШтрихкодКоробки
	|ИЗ
	|	ВТ_КА
	|УПОРЯДОЧИТЬ ПО
	|	КодАгрегации
	|";
	
	Местонахождение		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Местонахождение",		ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла()); 
	//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
	//СпособВводаВОборот	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "СпособВводаВОборот",	Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков);
	
	СпособВводаВОборот	= Новый Массив;	
	
	//+++Чирков Д.С. 27.03.2026- дичь была
	СпособВводаВОборот.Добавить(МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "СпособВводаВОборот", Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков));	
	Если СпособВводаВОборот[0] = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков Тогда
		СпособВводаВОборот.Добавить(Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка);
	ИначеЕсли СпособВводаВОборот[0] = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка Тогда
		СпособВводаВОборот.Добавить(Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков);
	КонецЕсли;
	//---Чирков Д.С.
	
	//Валетов -
	Статус				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус",				Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати);
	
	Запрос.УстановитьПараметр("Местонахождение", 	Местонахождение);
	Запрос.УстановитьПараметр("СпособВводаВОборот",	СпособВводаВОборот);
	Запрос.УстановитьПараметр("ТипУпаковки",		ТипУпаковки);
	Запрос.УстановитьПараметр("Статус",				Статус);	
	Запрос.УстановитьПараметр("ТипШК", 				ТипШК);	
	
	Попытка
		Результат.Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодКоробки");	
	Исключение
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить("Блокировка транзакции. " + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
		
	ПолученоКМ = Результат.Данные.Количество();
	Если ПолученоКМ <> Количество Тогда	
		ТекстОшибки = СтрШаблон("Найдено %1 свободных, из %2 требуемых кодов маркировки (%3).", ПолученоКМ, Количество, ТипШК);		
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	ТекстСообщения = СтрШаблон("ШтрихкодыУпаковокТоваров.ПолучитьСвободныеКодыАгрегации. Получено: %1 кодов агрегации.", Количество);
	ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", ТекстСообщения, , , , (ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало)/1000);
	
	Возврат Результат;
КонецФункции //ПолучитьСвободныеКодыАгрегации(ТипШК, Количество, ДопПараметры = Неопределено) Экспорт

Функция ПолучитьСвободныеКодыАгрегации_Новая(ТипШК, ТипУпаковки, Количество, ДопПараметры = Неопределено)
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат = МаркировкаКС.СтруктураРезультата();
		
	Запрос = Новый Запрос;   
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ " + МаркировкаКС.ЧислоБезДури(Количество) + "
	|	СтатусыКМ_СрезПоследних.ШтрихКодУпаковки КАК ШтрихкодКоробки
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт_А.СрезПоследних( ,	
	|		ТипШК = &ТипШК
	|		И СпособВводаВОборот В (&СпособВводаВОборот)
	//|		И ТипУпаковки = &ТипУпаковки		
	|		И НЕ ШтрихКодУпаковки.ПометкаУдаления
	|	) КАК СтатусыКМ_СрезПоследних
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ИспользованныеКодыАгрегаций КАК ИспользованныеКодыАгрегаций
	|ПО 
	|	СтатусыКМ_СрезПоследних.ШтрихКодУпаковки = ИспользованныеКодыАгрегаций.ШтрихКодУпаковки
	|ГДЕ
	|	СтатусыКМ_СрезПоследних.Местонахождение = &Местонахождение
	|	И НЕ СтатусыКМ_СрезПоследних.ВПути
	|	И СтатусыКМ_СрезПоследних.Статус = &Статус
	|	И ИспользованныеКодыАгрегаций.ШтрихКодУпаковки ЕСТЬ NULL
	|";
	
	Местонахождение		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Местонахождение",		ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());
	//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
	//СпособВводаВОборот	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "СпособВводаВОборот",	Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков);
	СпособВводаВОборот	= Новый Массив;
	СпособВводаВОборот.Добавить(МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "СпособВводаВОборот",	Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков));
	СпособВводаВОборот.Добавить(МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "СпособВводаВОборот",	Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка));
	//Валетов -
	Статус				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус",				Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати);
	
	Запрос.УстановитьПараметр("Местонахождение", 	Местонахождение);
	Запрос.УстановитьПараметр("СпособВводаВОборот",	СпособВводаВОборот);
	Запрос.УстановитьПараметр("ТипШК",				ТипШК);
	Запрос.УстановитьПараметр("ТипУпаковки",		ТипУпаковки);
	Запрос.УстановитьПараметр("Статус",				Статус);
	
	Попытка
		Результат.Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодКоробки");	
	Исключение
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить("Блокировка транзакции. " + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
		
	ПолученоКМ = Результат.Данные.Количество();
	Если ПолученоКМ <> Количество Тогда	
		ТекстОшибки = СтрШаблон("Найдено %1 свободных, из %2 требуемых кодов маркировки (%3).", ПолученоКМ, Количество, ТипШК);		
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	ТекстСообщения = СтрШаблон("ШтрихкодыУпаковокТоваров.ПолучитьСвободныеКодыАгрегации. Получено: %1 кодов агрегации.", Количество);
	ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт_А", ТекстСообщения, , , , (ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало)/1000);
	
	Возврат Результат;
КонецФункции //ПолучитьСвободныеКодыАгрегации_Новая(ТипШК, Количество, ДопПараметры = Неопределено) Экспорт


Функция ТипКМпоУмолчанию(Номенклатура)
	ВидКомплекта = ПолучитьРеквизитШапки(Номенклатура, "Родитель.ВидКомплекта");
	
	Возврат ?(ВидКомплекта = Перечисления.ВидыКомплектов.Товар, Перечисления.ТипыКодовМаркировки.Товар, Перечисления.ТипыКодовМаркировки.Набор);
КонецФункции //ТипКМпоУмолчанию(Номенклатура)

#КонецОбласти


#КонецОбласти
